In [2]:
# b에 값이 있으면 참 아니면 X
b = ""
if b:
    print('성공')
else:
    print('실패')

실패

In [3]:
for i in range(1, 10, 1):
    print("%d 번째 반복입니다." %i)
# %d 정수, %s 문자열, %f 실수

1 번째 반복입니다.
2 번째 반복입니다.
3 번째 반복입니다.
4 번째 반복입니다.
5 번째 반복입니다.
6 번째 반복입니다.
7 번째 반복입니다.
8 번째 반복입니다.
9 번째 반복입니다.

In [8]:
dict_list =[{"name" : "test1", "password" : "1234"}, 
            {"name" : "test2", "password" : "1234"}, 
            {"name" : "test3", "password" : "1234"},]

# list형태의 데이터를 각 항별로 순서대로 출력하는 for문
for i in range(0, len(dict_list), 1):
    print(dict_list[i])

{'name': 'test1', 'password': '1234'}
{'name': 'test2', 'password': '1234'}
{'name': 'test3', 'password': '1234'}

In [9]:
for i in dict_list:
    print(i["name"])

test1
test2
test3

In [15]:
sum = 0
while sum < len(dict_list):
    print(dict_list[sum])
    sum += 1

{'name': 'test1', 'password': '1234'}
{'name': 'test2', 'password': '1234'}
{'name': 'test3', 'password': '1234'}

In [27]:
# 함수 def 함수명(매개변수, 매개변수):
# 함수를 호출 -> 함수명 (인자, 인자)
# 함수를 만들어봅시다 -> 함수를 호출 -> dict_list print ->
# 인자값에 키값을 넣어주고 -> 그 키값에 해당하는 값만 출력이 되도록
def func(input_key):
    for list in dict_list:
        print(list[input_key])
func("password")

1234
1234
1234

In [28]:
def func1(list, input_key):
    i = 0
    while i < len(list):
        print(list[i][input_key])
        i += 1
func1(dict_list, "password")

1234
1234
1234

In [41]:
#전역변수 지역변수
#def 함수1(a,b,c):
def func_1(a,b,c):
    d = a + b
    def func_2():
        result = d - c
        return result
    print(func_2())

func_1(3,4,5)

2

In [42]:
def func_9(input_a,input_b):
    sum = input_a + input_b
    return sum

def func_10(input_c, input_d, input_e):
    sum_2 = func_9(input_c, input_d)
    result = sum_2 - input_e
    return result

print(func_10(7,4,2))

9

In [68]:
#함수 3개
#함수1 -> 두 수의 합, 함수2 -> 두 수의 차
#함수3 -> def 함수3(a,b,c): -> c의 값이 'S'면 함수1(a,b)
#C의 값이 'D'면 함수2(a,b) -> 호출 --> print(함수3)
def fun_1(a,b):
    result = a + b
    return result

def fun_2(a,b):
    result = a - b
    return result

def fun_3(a, b, c):
    if c == "S":
        d = fun_1(a,b)
    elif c == "D":
        d = fun_2(a,b)
    else:
        d = "Not Matched"
    return d
print(fun_3(7,8,"S"))

15

In [89]:
# 함수 -> 입력 2개 a ~ b, c= "짝수", "홀수"
# c 값에 따라 a ~ b 사이의 홀수, 짝수 변환
# 반환되는 값의 데이터형태는 자유
def func_14(a,b):
    _list = []
    for i in range(a,b+1,1):
       if i % 2 ==0:
           _list.append(i)
    return _list

def func_15(a,b):
    _list = []
    for i in range(a,b+1,1):
       if i % 2 ==1:
           _list.append(i)
    return _list

def func_16(a,b,c):
    if c == "짝수":
        return func_14(a,b)
    elif c == "홀수":
        return func_15(a,b)

# None이 나오면 함수에 return이 없는지 확인

print(func_16(1,20,"홀수"))

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [94]:
_list_2 = []
def func_14(a,b):
    for i in range(a,b+1,1):
       if i % 2 ==0:
           _list_2.append(i)
        #    print(i)

def func_15(a,b):
    for i in range(a,b+1,1):
       if i % 2 ==1:
           _list_2.append(i)
        #    print(i)

def func_16(a,b,c):
    if c == "짝수":
        func_14(a,b)
    elif c == "홀수":
        func_15(a,b)
    print(_list_2)

func_16(1,10,"홀수")

[1, 3, 5, 7, 9]

In [4]:
import pandas as pd

# index, column, value 지정 -> pd.DataFrame(value, index='index', column='olumn')
# index 없으면 자동으로
df_1 = pd.DataFrame(['a', 'b', 'c'], columns=['A'])
df_1

   A
0  a
1  b
2  c

In [5]:
df_1['B'] = ["A", "B", "C"]
df_1

   A  B
0  a  A
1  b  B
2  c  C

In [7]:
df_1['B'] = [1,2,3]
df_1

   A  B
0  a  1
1  b  2
2  c  3

In [8]:
df_1['B']= "A"
df_1

   A  B
0  a  A
1  b  A
2  c  A

In [9]:
df_1["A"]

0    a
1    b
2    c
Name: A, dtype: object

In [11]:
df_1.A

0    a
1    b
2    c
Name: A, dtype: object

In [12]:
df_1.columns = ["a", "b"]
df_1

   a  b
0  a  A
1  b  A
2  c  A

In [13]:
values = [["test1", "20000"], ["test2", "30000"], ["test3", "10000"]]
columns = ["name", "pay"]

df_2 = pd.DataFrame(values, columns=columns)
df_2

    name    pay
0  test1  20000
1  test2  30000
2  test3  10000

In [14]:
df_2.sort_values('pay')

    name    pay
2  test3  10000
0  test1  20000
1  test2  30000

In [16]:
df_2.sort_values('pay', ascending=False)

    name    pay
1  test2  30000
0  test1  20000
2  test3  10000

In [19]:
df_2.sort_index(ascending=False)

    name    pay
2  test3  10000
1  test2  30000
0  test1  20000

In [20]:
df_3 = df_2.copy()
df_3

    name    pay
0  test1  20000
1  test2  30000
2  test3  10000

In [21]:
df_4 = df_3.drop(["name"], axis=1)
df_4

     pay
0  20000
1  30000
2  10000

In [22]:
df_5 = df_3.drop([0], axis=0)
df_5

    name    pay
1  test2  30000
2  test3  10000

In [25]:
df_5.to_csv('./test.csv', encoding='utf-8')
# ../상위폴더 ./현재폴더